19-rails-validations/snack-tracker/app/controllers/retailers_controller.rb

  def index
    @retailers = Retailer.all
---
SELECT "retailers".* FROM "retailers"

  def show
    @retailer = Retailer.find(params[:id])
---
SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @retailer = Retailer.create(strong_params)
---
INSERT INTO "retailers" ("name", "year_established", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fritolays"], ["year_established", 20000], ["created_at", "2018-07-03 20:18:34.939891"], ["updated_at", "2018-07-03 20:18:34.939891"]]