19-rails-validations/snack-tracker/app/controllers/snacks_controller.rb

  def index
    @snacks = Snack.all
---
SELECT "snacks".* FROM "snacks"

  def create
    # post request to make the snack from the form
    @snack = Snack.create(snack_strong_params)
---
INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sliders"], ["calories", 800], ["deliciousness", 1], ["created_at", "2018-07-02 14:55:44.836766"], ["updated_at", "2018-07-02 14:55:44.836766"]]

  def update
    # update snack based on form
    @snack.update(snack_strong_params)
---
UPDATE "snacks" SET "deliciousness" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["deliciousness", 3], ["updated_at", "2018-07-02 15:07:21.224970"], ["id", 1]]

  def destroy
    Snack.destroy(params[:id])
---
DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 1]]

  def find_snack
    @snack = Snack.find(params[:id])
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]