19-rails-validations/snack-tracker/app/views/snacks/_edit_form.html.erb

SELECT "retailers".* FROM "retailers"
---
    <%= f.label :retailer %>
    <%= f.collection_select(:retailer_id, Retailer.all, :id, :name, prompt: true) %>