17-rails-crud/snack-tracker/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sliders"], ["calories", 450], ["deliciousness", 1], ["created_at", "2018-06-29 19:42:47.662684"], ["updated_at", "2018-06-29 19:42:47.662684"]]
---
  def create
    snack = Snack.create(snack_required_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 7]]
---
  def destroy
    Snack.destroy(params[:id])

UPDATE "snacks" SET "deliciousness" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["deliciousness", 4], ["updated_at", "2018-06-29 20:09:23.559867"], ["id", 4]]
---
  def update
    @snack.update(snack_required_params)

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_snack
    @snack = Snack.find(params[:id])